Repository: wly-p/training-la
Catalog: Packages/Plan/Sources/PlanPresentation/Localizable.xcstrings
Source language: zh_hant
Languages: en

# picker.createNew
source: 新建
en: New

# picker.createNewRow %@
source: 新建「%@」
en: New “%@”

# picker.matchCount %lld
source: %lld 個相符 · 中英名稱都會比對
en: %lld matches · name search (any language)

# picker.section.all
source: 全部
en: All

# picker.section.allFiltered
source: 全部
en: All

# picker.section.recent
source: 最近用過
en: Recently used

# plan.activate
source: 啟用
en: Activate

# plan.addBlank
source: 空白建立
en: Blank

# plan.addExercise
source: 加入動作
en: Add Exercise

# plan.addFromTemplate
source: 從範本加入
en: From Template

# plan.addThisDay
source: 加入這天
en: Add to This Day

# plan.applyProgram
source: 套用長期課表
en: Apply Program

# plan.back
source: 返回
en: Back

# plan.calendar.legend.completed
source: 已完成
en: Completed

# plan.calendar.legend.projected
source: 長期課表
en: From program

# plan.calendar.legend.scheduled
source: 已排定
en: Scheduled

# plan.calendar.legend.selected
source: 選取
en: Selected

# plan.calendar.legend.today
source: 今天
en: Today

# plan.calendar.nextMonth
source: 下個月
en: Next month

# plan.calendar.prevMonth
source: 上個月
en: Previous month

# plan.calendar.today
source: 今天
en: Today

# plan.cancel
source: 取消
en: Cancel

# plan.close
source: 關閉
en: Close

# plan.date
source: 日期
en: Date

# plan.day.count %lld
source: %lld 個動作
en: %lld exercises

# plan.day.empty
source: 這天沒有排課
en: No plan on this day

# plan.delete
source: 刪除
en: Delete

# plan.done
source: 完成
en: Done

# plan.edit
source: 編輯排課
en: Edit Plan

# plan.edit.short
source: 編輯
en: Edit

# plan.empty
source: 還沒有排課
en: No plans yet

# plan.empty.hint
source: 排課只是預填來源，不排課也能直接記錄訓練
en: Plans are just a template — you can log workouts without one.

# plan.emptyLibrary
source: 動作庫是空的
en: Your exercise library is empty

# plan.emptyLibrary.hint
source: 先到動作庫建立動作
en: Create an exercise in the Exercises tab first

# plan.error
source: 出錯了
en: Something Went Wrong

# plan.error.actionFailed %@
source: 操作失敗：%@
en: Action failed: %@

# plan.error.loadFailed %@
source: 讀取課表失敗：%@
en: Failed to load plans: %@

# plan.error.needExercise
source: 排課至少要有一個動作
en: A plan needs at least one exercise

# plan.exercises
source: 動作
en: Exercises

# plan.name.placeholder
source: 名稱（例：推日）
en: Name (e.g. Push Day)

# plan.new
source: 新增排課
en: New Plan

# plan.ok
source: 好
en: OK

# plan.projected
source: 排定
en: Scheduled

# plan.readOnly.hint
source: 已完成，僅供檢視、不可編輯
en: Completed — view only, not editable

# plan.reps
source: 次數
en: Reps

# plan.rest
source: 休息
en: Rest

# plan.restNone
source: 不設休息
en: No rest

# plan.restSeconds %lld
source: 休息 %lld 秒
en: Rest %lld s

# plan.save
source: 儲存
en: Save

# plan.searchExercises
source: 搜尋動作
en: Search exercises

# plan.searchTemplates
source: 搜尋範本
en: Search templates

# plan.sec
source: 秒
en: sec

# plan.sec.optional
source: 秒（可留空）
en: sec (optional)

# plan.setCount %lld
source: 組數：%lld
en: Sets: %lld

# plan.setCountUnit %lld
source: %lld組
en: %lld sets

# plan.target
source: 目標
en: Target

# plan.title
source: 課表
en: Plans

# plan.untitled
source: 未命名
en: Untitled

# plan.view
source: 檢視排課
en: View Plan

# plan.weight
source: 重量
en: Weight

# plan.weight.percentOfMax %@
source: %@ 最大重量
en: %@ of max

# plan.weight.relativeToLast %@
source: 上次%@
en: Last %@

# program.apply.activeHeader
source: 套用中
en: Active

# program.apply.confirm
source: 套用
en: Apply

# program.apply.hint
source: 套用後未來投影到月曆；過去漏做會補成未開始
en: Future days project onto the calendar; missed past days become not-started records

# program.apply.mode
source: 模式
en: Mode

# program.apply.none
source: 還沒有長期課表可套用（先到動作庫建立）
en: No programs to apply yet — create one in the library

# program.apply.pick
source: 選課表
en: Program

# program.apply.startDate
source: 起始日
en: Start Date

# program.apply.stop
source: 停用
en: Stop

# program.cycle.changeLength
source: 改長度
en: Change length

# program.cycle.header %lld
source: 週期 · %lld 天
en: Cycle · %lld days

# program.cycleLength
source: 週期天數
en: Cycle Length

# program.day.nextPrompt
source: 選一個範本，或設為休息
en: Pick a template, or set as rest

# program.day.rest
source: 休息
en: Rest

# program.day.setRest
source: 設為休息
en: Set as rest

# program.day.unassigned
source: 未指派
en: Unassigned

# program.dayUnit
source: 天
en: days

# program.deactivate.confirm.message
source: 未來的投影會停止；已落地的排課與紀錄不受影響。
en: Future projection stops; materialized workouts and records are unaffected.

# program.deactivate.confirm.title
source: 停用這個計畫？
en: Deactivate this program?

# program.delete.confirm.message
source: 刪除後無法復原（不影響已完成的訓練紀錄）。
en: This cannot be undone (past workout records are unaffected).

# program.delete.confirm.title
source: 刪除這個計畫？
en: Delete this program?

# program.delete.thisProgram
source: 刪除這個計畫
en: Delete this program

# program.detail.kicker.active
source: 長期 · 進行中
en: Program · Active

# program.detail.kicker.inactive
source: 長期 · 未啟用
en: Program · Inactive

# program.empty
source: 還沒有長期課表
en: No Programs Yet

# program.empty.hint
source: 建一份 N 天週期的計畫，套用到月曆
en: Create an N-day cycle plan and apply it to the calendar

# program.error.needName
source: 請幫長期課表取個名稱
en: Please give the program a name

# program.explainer
source: 長期＝有終點的計畫。 循環＝沒有終點，一直輪。
en: A program has an end. A rotation loops forever.

# program.intensity.footer
source: 套用到這個計畫的每一格，範本本身不會被改。依各動作的遞增單位向下取整。
en: Applies to every slot in this program — the template itself is never changed. Rounded down to each exercise's weight increment.

# program.librarySummary %lld %lld
source: %1$lld 個範本・%2$lld 天週期
en: %1$lld templates · %2$lld-day cycle

# program.manage.deactivate
source: 停用
en: Deactivate

# program.manage.deactivate.hint
source: 保留紀錄 · 停止投影
en: Keeps records · stops projection

# program.manage.delete
source: 刪除這個計畫
en: Delete this program

# program.manage.resetProgress
source: 重設進度
en: Reset progress

# program.manage.resetProgress.hint
source: 回到第 1 天
en: Back to day 1

# program.mode.once
source: 跑一次
en: Once

# program.mode.repeating
source: 重複
en: Repeat

# program.name.placeholder
source: 名稱（例：PPL）
en: Name (e.g. PPL)

# program.picker.restSubtitle
source: 這天不排課
en: No workout this day

# program.picker.title
source: 指派這天
en: Assign this day

# program.preview.cycle %lld
source: %lld 天週期
en: %lld-day cycle

# program.preview.repeat %lld
source: 重複 %lld 輪
en: Repeat %lld times

# program.preview.section
source: 預覽
en: Preview

# program.preview.split %lld %lld
source: %1$lld 練 %2$lld 休
en: %1$lld on, %2$lld off

# program.preview.total %lld %lld
source: %1$lld 天 %2$lld 練
en: %1$lld days, %2$lld sessions

# program.preview.unassigned %lld
source: 還有 %lld 格未指派 · 填完才能儲存
en: %lld days left unassigned · finish before saving

# program.schedule.section
source: 每天安排
en: Daily schedule

# program.today
source: 今天
en: Today

# program.totalLength.custom
source: 自訂
en: Custom

# program.totalLength.days %lld
source: %lld 天
en: %lld days

# program.totalLength.section
source: 總長度
en: Total length

# rotation.active
source: 使用中
en: Active

# rotation.active.section
source: 進行中
en: Active

# rotation.addTemplate
source: 加入範本
en: Add template

# rotation.createdAfter.activateNow
source: 立刻啟用
en: Activate now

# rotation.createdAfter.footer
source: 啟用中的循環才會出現在訓練頁的候選清單。
en: Only active rotations show up as a candidate on the Training tab.

# rotation.createdAfter.section
source: 建立後
en: After creating

# rotation.createdAfter.startDay
source: 從第幾天開始
en: Start at day

# rotation.deactivate.confirm.message
source: 訓練首頁今天的候選會少一個；進度會保留，之後可再啟用。
en: One fewer candidate on Today; progress is kept and can be reactivated.

# rotation.deactivate.confirm.title
source: 停用這個循環？
en: Deactivate this rotation?

# rotation.delete.confirm.message
source: 刪除後無法復原（不影響已完成的訓練紀錄）。
en: This cannot be undone (past workout records are unaffected).

# rotation.delete.confirm.title
source: 刪除這個循環？
en: Delete this rotation?

# rotation.delete.thisRotation
source: 刪除這個循環
en: Delete this rotation

# rotation.detail.completed %lld
source: 已完成 %lld 次訓練
en: %lld workouts done

# rotation.detail.composition %lld
source: 組成 · %lld 個範本
en: Made of · %lld templates

# rotation.detail.kicker.active
source: 循環 · 進行中
en: Rotation · Active

# rotation.detail.kicker.inactive
source: 循環 · 未啟用
en: Rotation · Inactive

# rotation.empty
source: 還沒有循環課表
en: No Rotation Yet

# rotation.empty.hint
source: 建立一組會依序輪替的 workout；訓練首頁會顯示今天輪到哪一張
en: Add workouts that cycle in order; today's turn shows on the training home

# rotation.error.needName
source: 請幫循環課表取個名稱
en: Please give the rotation a name

# rotation.hint
source: 依序輪替，做一次進一張（做完回到第一張）
en: Cycles in order — advances one each time you start

# rotation.inactive.section
source: 未啟用
en: Inactive

# rotation.intensity.baseline
source: 基準
en: Baseline

# rotation.intensity.custom
source: 自訂
en: Custom

# rotation.intensity.footer
source: 套用到這個循環的每一格，範本本身不會被改。依各動作的遞增單位向下取整。
en: Applies to every slot in this rotation — the template itself is never changed. Rounded down to each exercise's weight increment.

# rotation.intensity.section
source: 強度基準
en: Intensity baseline

# rotation.intensity.useBaseline
source: 使用基準
en: Use baseline

# rotation.manage.deactivate
source: 停用
en: Deactivate

# rotation.manage.deactivate.hint
source: 保留進度 · 之後可再啟用
en: Keeps progress · reactivate later

# rotation.manage.delete
source: 刪除這個循環
en: Delete this rotation

# rotation.manage.footer
source: 停用不會刪掉任何訓練紀錄。
en: Deactivating deletes no workout records.

# rotation.manage.next
source: 跳到下一個範本
en: Skip to next template

# rotation.manage.reset
source: 重設輪次
en: Reset rounds

# rotation.manage.reset.hint
source: 回到第 1 輪
en: Back to round 1

# rotation.manage.section
source: 管理
en: Manage

# rotation.name.placeholder
source: 名稱（例：推拉腿）
en: Name (e.g. PPL)

# rotation.paused
source: 已停用
en: Paused

# rotation.pausedAt %lld
source: 停在第 %lld 輪
en: Paused at round %lld

# rotation.picker.addCount %lld
source: 加入 %lld 個範本
en: Add %lld templates

# rotation.picker.searchPrompt
source: 搜尋範本
en: Search templates

# rotation.picker.title
source: 加入範本
en: Add templates

# rotation.rename
source: 重新命名
en: Rename

# rotation.reorder.down
source: 下移
en: Move down

# rotation.reorder.remove
source: 移除
en: Remove

# rotation.reorder.up
source: 上移
en: Move up

# rotation.rounds %lld
source: %lld 輪
en: %lld rounds

# rotation.setsUnit
source: 組
en: sets

# rotation.stats.cycle %lld
source: %lld 天一輪
en: %lld-day cycle

# rotation.stats.minutes %lld
source: 約 %lld 分
en: ~%lld min

# rotation.stats.setsPerRound %lld
source: 每輪 %lld 組
en: %lld sets per round

# rotation.templateCount %lld
source: %lld 個範本
en: %lld templates

# rotation.workouts.section
source: 範本順序
en: Template order

# template.addExercise
source: 從動作庫加入
en: Add from library

# template.block.decreasing %lld
source: %lld 組 · 遞減
en: %lld sets · descending

# template.block.mixed %lld
source: %lld 組 · 各組不同
en: %lld sets · varied

# template.block.progressive %lld
source: %lld 組 · 遞增
en: %lld sets · progressive

# template.collapse
source: 收起
en: Collapse

# template.delete
source: 刪除
en: Delete

# template.delete.confirm.message
source: 刪除後無法復原，已排進課表的排課不受影響。
en: This can't be undone. Already scheduled workouts aren't affected.

# template.delete.confirm.title
source: 刪除這個範本？
en: Delete this template?

# template.delete.thisTemplate
source: 刪除這個範本
en: Delete this template

# template.duplicate
source: 複製
en: Duplicate

# template.duplicatedFrom %@
source: 從「%@」複製
en: Duplicated from “%@”

# template.empty
source: 還沒有課表範本
en: No Templates Yet

# template.empty.hint
source: 建立可重複使用的課表範本，開始訓練時直接套用
en: Create reusable templates to apply when you start a workout

# template.error.needName
source: 請幫範本取個名稱
en: Please give the template a name

# template.exercises.section
source: 動作
en: Exercises

# template.explainer
source: 範本是「一次訓練要做什麼」。 排進課表或放進循環／長期都用它。
en: A template is "what one workout does". Use it in a schedule, rotation, or program.

# template.name.placeholder
source: 範本名稱
en: Template name

# template.picker.addCount %lld
source: 加入 %lld 個動作
en: Add %lld exercises

# template.reorder.down
source: 下移
en: Move down

# template.reorder.remove
source: 移除
en: Remove

# template.reorder.up
source: 上移
en: Move up

# template.sectionTitle
source: 一次訓練的內容
en: What one workout contains

# template.set.absolute
source: 絕對值
en: Absolute

# template.set.copyPrevious
source: 同上組
en: Same as prev

# template.set.percent
source: % 最大重量
en: % max weight

# template.set.percentKicker
source: % 最大重量
en: % max weight

# template.set.relative
source: 相對上次
en: Relative to last

# template.set.relativeKicker
source: 相對上次（KG）
en: Relative to last (KG)

# template.set.remove
source: 移除這組
en: Remove this set

# template.set.weightKicker
source: 重量（KG）
en: Weight (KG)

# template.setNumber %lld
source: 組 %lld
en: Set %lld

# template.setNumber.reps
source: 次數
en: Reps

# template.shortcut.addSet
source: + 加一組
en: + Add set

# template.shortcut.progressive
source: 遞增
en: Progressive

# template.shortcut.same
source: 全部相同
en: Same for all

# template.stats.exercises %lld
source: %lld 個動作
en: %lld exercises

# template.stats.minutes %lld
source: 約 %lld 分
en: ~%lld min

# template.stats.sets %lld
source: %lld 組
en: %lld sets

# template.stats.summary %lld %lld %lld
source: %lld 個動作 · %lld 組 · 約 %lld 分
en: %lld exercises · %lld sets · ~%lld min
